SELECT 
    z."id_заказа",
    SUM(
        pz."количество" * (
            SELECT SUM(ss."норма_расхода" * sm."цена_за_единицу")
            FROM "Состав_Спецификации" ss
            JOIN "Справочник_Материалов" sm 
              ON ss."id_материала" = sm."id_материала"
            WHERE ss."id_спецификации" = (
                SELECT "id_спецификации"
                FROM "Спецификация"
                WHERE "id_продукции" = pz."id_продукции"
                ORDER BY "дата_утверждения" DESC
                LIMIT 1
            )
        )
    ) AS полная_стоимость_заказа_по_материалам
FROM "Заказ" z
JOIN "Позиция_Заказа" pz ON z."id_заказа" = pz."id_заказа"
GROUP BY z."id_заказа"
ORDER BY z."id_заказа";
